#+title: Readme

* Readme

** Download

#+begin_src sh :shebang "#!/usr/bin/env sh"
java -jar \
    /home/chu/.local/bin/exercism-track-downloader.jar \
        exercises \
            -d bash \
            -d common-lisp \
            -d emacs-lisp \
            -d racket \
            -d scheme
#+end_src

#+RESULTS:
|           |                         |           |          |          |                                      |
| ========= | [33;1mbash[m        | ========= |          |          |                                      |
| You       | have                    | not       | unlocked | exercise | [31;1mhello-world[m              |
| You       | have                    | not       | unlocked | exercise | [31;1mtwo-fer[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1merror-handling[m           |
| You       | have                    | not       | unlocked | exercise | [31;1mraindrops[m                |
| You       | have                    | not       | unlocked | exercise | [31;1mhamming[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1macronym[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1marmstrong-numbers[m        |
| You       | have                    | not       | unlocked | exercise | [31;1mpangram[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mbob[m                      |
| You       | have                    | not       | unlocked | exercise | [31;1mscrabble-score[m           |
| You       | have                    | not       | unlocked | exercise | [31;1mgrains[m                   |
| You       | have                    | not       | unlocked | exercise | [31;1mluhn[m                     |
| You       | have                    | not       | unlocked | exercise | [31;1matbash-cipher[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mreverse-string[m           |
| You       | have                    | not       | unlocked | exercise | [31;1mleap[m                     |
| You       | have                    | not       | unlocked | exercise | [31;1mresistor-color-duo[m       |
| You       | have                    | not       | unlocked | exercise | [31;1msecret-handshake[m         |
| You       | have                    | not       | unlocked | exercise | [31;1mdarts[m                    |
| You       | have                    | not       | unlocked | exercise | [31;1mdnd-character[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mmatching-brackets[m        |
| You       | have                    | not       | unlocked | exercise | [31;1mproverb[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mresistor-color-trio[m      |
| You       | have                    | not       | unlocked | exercise | [31;1msieve[m                    |
| You       | have                    | not       | unlocked | exercise | [31;1mgrep[m                     |
| You       | have                    | not       | unlocked | exercise | [31;1mtournament[m               |
| You       | have                    | not       | unlocked | exercise | [31;1mbowling[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mocr-numbers[m              |
| You       | have                    | not       | unlocked | exercise | [31;1mclock[m                    |
| You       | have                    | not       | unlocked | exercise | [31;1mmarkdown[m                 |
| You       | have                    | not       | unlocked | exercise | [31;1mrectangles[m               |
| You       | have                    | not       | unlocked | exercise | [31;1mhouse[m                    |
| You       | have                    | not       | unlocked | exercise | [31;1mnucleotide-count[m         |
| You       | have                    | not       | unlocked | exercise | [31;1mrotational-cipher[m        |
| You       | have                    | not       | unlocked | exercise | [31;1mbinary-search[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mkindergarten-garden[m      |
| You       | have                    | not       | unlocked | exercise | [31;1mrobot-simulator[m          |
| You       | have                    | not       | unlocked | exercise | [31;1mrun-length-encoding[m      |
| You       | have                    | not       | unlocked | exercise | [31;1mtranspose[m                |
| You       | have                    | not       | unlocked | exercise | [31;1myacht[m                    |
| You       | have                    | not       | unlocked | exercise | [31;1mpoker[m                    |
| You       | have                    | not       | unlocked | exercise | [31;1mtwo-bucket[m               |
| You       | have                    | not       | unlocked | exercise | [31;1mwordy[m                    |
| You       | have                    | not       | unlocked | exercise | [31;1mrail-fence-cipher[m        |
| You       | have                    | not       | unlocked | exercise | [31;1mdifference-of-squares[m    |
| You       | have                    | not       | unlocked | exercise | [31;1mprime-factors[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mtriangle[m                 |
| You       | have                    | not       | unlocked | exercise | [31;1mall-your-base[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mgigasecond[m               |
| You       | have                    | not       | unlocked | exercise | [31;1misbn-verifier[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mpascals-triangle[m         |
| You       | have                    | not       | unlocked | exercise | [31;1mdiffie-hellman[m           |
| You       | have                    | not       | unlocked | exercise | [31;1mrational-numbers[m         |
| You       | have                    | not       | unlocked | exercise | [31;1mvariable-length-quantity[m |
| You       | have                    | not       | unlocked | exercise | [31;1mrna-transcription[m        |
| You       | have                    | not       | unlocked | exercise | [31;1managram[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1misogram[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mphone-number[m             |
| You       | have                    | not       | unlocked | exercise | [31;1mprotein-translation[m      |
| You       | have                    | not       | unlocked | exercise | [31;1mword-count[m               |
| You       | have                    | not       | unlocked | exercise | [31;1mdiamond[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1msublist[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mbeer-song[m                |
| You       | have                    | not       | unlocked | exercise | [31;1mqueen-attack[m             |
| You       | have                    | not       | unlocked | exercise | [31;1mtwelve-days[m              |
| You       | have                    | not       | unlocked | exercise | [31;1mpig-latin[m                |
| You       | have                    | not       | unlocked | exercise | [31;1mcrypto-square[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mfood-chain[m               |
| You       | have                    | not       | unlocked | exercise | [31;1mmeetup[m                   |
| You       | have                    | not       | unlocked | exercise | [31;1mspiral-matrix[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mlargest-series-product[m   |
| You       | have                    | not       | unlocked | exercise | [31;1mseries[m                   |
| You       | have                    | not       | unlocked | exercise | [31;1mcollatz-conjecture[m       |
| You       | have                    | not       | unlocked | exercise | [31;1mspace-age[m                |
| You       | have                    | not       | unlocked | exercise | [31;1msquare-root[m              |
| You       | have                    | not       | unlocked | exercise | [31;1msay[m                      |
| You       | have                    | not       | unlocked | exercise | [31;1mpythagorean-triplet[m      |
| You       | have                    | not       | unlocked | exercise | [31;1mchange[m                   |
| You       | have                    | not       | unlocked | exercise | [31;1mknapsack[m                 |
| You       | have                    | not       | unlocked | exercise | [31;1mallergies[m                |
| You       | have                    | not       | unlocked | exercise | [31;1mperfect-numbers[m          |
| You       | have                    | not       | unlocked | exercise | [31;1msum-of-multiples[m         |
| You       | have                    | not       | unlocked | exercise | [31;1mroman-numerals[m           |
| You       | have                    | not       | unlocked | exercise | [31;1mnth-prime[m                |
| You       | have                    | not       | unlocked | exercise | [31;1mpalindrome-products[m      |
| You       | have                    | not       | unlocked | exercise | [31;1msimple-cipher[m            |
| You       | have                    | not       | unlocked | exercise | [31;1maffine-cipher[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mforth[m                    |
| You       | have                    | not       | unlocked | exercise | [31;1msatellite[m                |
| You       | have                    | not       | unlocked | exercise | [31;1mlist-ops[m                 |
|           |                         |           |          |          |                                      |
| ========= | [33;1mcommon-lisp[m | ========= |          |          |                                      |
| You       | have                    | not       | unlocked | exercise | [31;1mhello-world[m              |
| You       | have                    | not       | unlocked | exercise | [31;1msocks-and-sexprs[m         |
| You       | have                    | not       | unlocked | exercise | [31;1mkey-comparison[m           |
| You       | have                    | not       | unlocked | exercise | [31;1mpizza-pi[m                 |
| You       | have                    | not       | unlocked | exercise | [31;1mleslies-lists[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mpal-picker[m               |
| You       | have                    | not       | unlocked | exercise | [31;1mlillys-lasagna[m           |
| You       | have                    | not       | unlocked | exercise | [31;1mlillys-lasagna-leftovers[m |
| You       | have                    | not       | unlocked | exercise | [31;1mlog-levels[m               |
| You       | have                    | not       | unlocked | exercise | [31;1mcharacter-study[m          |
| You       | have                    | not       | unlocked | exercise | [31;1mlarrys-winning-checker[m   |
| You       | have                    | not       | unlocked | exercise | [31;1mhigh-scores[m              |
| You       | have                    | not       | unlocked | exercise | [31;1mlucys-magnificent-mapper[m |
| You       | have                    | not       | unlocked | exercise | [31;1mgigasecond-anniversary[m   |
| You       | have                    | not       | unlocked | exercise | [31;1mlogans-numeric-partition[m |
| You       | have                    | not       | unlocked | exercise | [31;1mreporting-for-duty[m       |
| You       | have                    | not       | unlocked | exercise | [31;1mtwo-fer[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mhamming[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mrna-transcription[m        |
| You       | have                    | not       | unlocked | exercise | [31;1mleap[m                     |
| You       | have                    | not       | unlocked | exercise | [31;1managram[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mbeer-song[m                |
| You       | have                    | not       | unlocked | exercise | [31;1mroman-numerals[m           |
| You       | have                    | not       | unlocked | exercise | [31;1mword-count[m               |
| You       | have                    | not       | unlocked | exercise | [31;1mbob[m                      |
| You       | have                    | not       | unlocked | exercise | [31;1mtwelve-days[m              |
| You       | have                    | not       | unlocked | exercise | [31;1macronym[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mall-your-base[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mallergies[m                |
| You       | have                    | not       | unlocked | exercise | [31;1marmstrong-numbers[m        |
| You       | have                    | not       | unlocked | exercise | [31;1mbinary-search[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mcollatz-conjecture[m       |
| You       | have                    | not       | unlocked | exercise | [31;1mdifference-of-squares[m    |
| You       | have                    | not       | unlocked | exercise | [31;1metl[m                      |
| You       | have                    | not       | unlocked | exercise | [31;1mgrains[m                   |
| You       | have                    | not       | unlocked | exercise | [31;1misogram[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mnucleotide-count[m         |
| You       | have                    | not       | unlocked | exercise | [31;1mpascals-triangle[m         |
| You       | have                    | not       | unlocked | exercise | [31;1mperfect-numbers[m          |
| You       | have                    | not       | unlocked | exercise | [31;1mraindrops[m                |
| You       | have                    | not       | unlocked | exercise | [31;1mscrabble-score[m           |
| You       | have                    | not       | unlocked | exercise | [31;1msieve[m                    |
| You       | have                    | not       | unlocked | exercise | [31;1mspace-age[m                |
| You       | have                    | not       | unlocked | exercise | [31;1mstrain[m                   |
| You       | have                    | not       | unlocked | exercise | [31;1msublist[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mtriangle[m                 |
| You       | have                    | not       | unlocked | exercise | [31;1matbash-cipher[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mgrade-school[m             |
| You       | have                    | not       | unlocked | exercise | [31;1mphone-number[m             |
| You       | have                    | not       | unlocked | exercise | [31;1mprime-factors[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mrobot-name[m               |
| You       | have                    | not       | unlocked | exercise | [31;1mrobot-simulator[m          |
| You       | have                    | not       | unlocked | exercise | [31;1mcrypto-square[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mmeetup[m                   |
| You       | have                    | not       | unlocked | exercise | [31;1mluhn[m                     |
| You       | have                    | not       | unlocked | exercise | [31;1mbook-store[m               |
| You       | have                    | not       | unlocked | exercise | [31;1misbn-verifier[m            |
| You       | have                    | not       | unlocked | exercise | [31;1msum-of-multiples[m         |
| You       | have                    | not       | unlocked | exercise | [31;1mmatching-brackets[m        |
| You       | have                    | not       | unlocked | exercise | [31;1mrun-length-encoding[m      |
| You       | have                    | not       | unlocked | exercise | [31;1mlargest-series-product[m   |
| You       | have                    | not       | unlocked | exercise | [31;1mqueen-attack[m             |
| You       | have                    | not       | unlocked | exercise | [31;1mnth-prime[m                |
| You       | have                    | not       | unlocked | exercise | [31;1mknapsack[m                 |
| You       | have                    | not       | unlocked | exercise | [31;1mrail-fence-cipher[m        |
| You       | have                    | not       | unlocked | exercise | [31;1mpig-latin[m                |
| You       | have                    | not       | unlocked | exercise | [31;1mprotein-translation[m      |
| You       | have                    | not       | unlocked | exercise | [31;1msaddle-points[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mmatrix[m                   |
| You       | have                    | not       | unlocked | exercise | [31;1mpalindrome-products[m      |
| You       | have                    | not       | unlocked | exercise | [31;1mpythagorean-triplet[m      |
| You       | have                    | not       | unlocked | exercise | [31;1maffine-cipher[m            |
| You       | have                    | not       | unlocked | exercise | [31;1msay[m                      |
| You       | have                    | not       | unlocked | exercise | [31;1mtwo-bucket[m               |
| You       | have                    | not       | unlocked | exercise | [31;1mflatten-array[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mspiral-matrix[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mdiamond[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mrotational-cipher[m        |
| You       | have                    | not       | unlocked | exercise | [31;1mpangram[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1msecret-handshake[m         |
| You       | have                    | not       | unlocked | exercise | [31;1mdarts[m                    |
| You       | have                    | not       | unlocked | exercise | [31;1mproverb[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mfood-chain[m               |
|           |                         |           |          |          |                                      |
| ========= | [33;1mracket[m      | ========= |          |          |                                      |
| You       | have                    | not       | unlocked | exercise | [31;1mhello-world[m              |
| You       | have                    | not       | unlocked | exercise | [31;1mgrains[m                   |
| You       | have                    | not       | unlocked | exercise | [31;1mtwo-fer[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mleap[m                     |
| You       | have                    | not       | unlocked | exercise | [31;1mdifference-of-squares[m    |
| You       | have                    | not       | unlocked | exercise | [31;1mperfect-numbers[m          |
| You       | have                    | not       | unlocked | exercise | [31;1mgigasecond[m               |
| You       | have                    | not       | unlocked | exercise | [31;1mbob[m                      |
| You       | have                    | not       | unlocked | exercise | [31;1mcollatz-conjecture[m       |
| You       | have                    | not       | unlocked | exercise | [31;1mhamming[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mscrabble-score[m           |
| You       | have                    | not       | unlocked | exercise | [31;1mtwelve-days[m              |
| You       | have                    | not       | unlocked | exercise | [31;1misogram[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mrobot-name[m               |
| You       | have                    | not       | unlocked | exercise | [31;1marmstrong-numbers[m        |
| You       | have                    | not       | unlocked | exercise | [31;1maffine-cipher[m            |
| You       | have                    | not       | unlocked | exercise | [31;1macronym[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mall-your-base[m            |
| You       | have                    | not       | unlocked | exercise | [31;1malphametics[m              |
| You       | have                    | not       | unlocked | exercise | [31;1mallergies[m                |
| You       | have                    | not       | unlocked | exercise | [31;1managram[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1metl[m                      |
| You       | have                    | not       | unlocked | exercise | [31;1mgrep[m                     |
| You       | have                    | not       | unlocked | exercise | [31;1mlist-ops[m                 |
| You       | have                    | not       | unlocked | exercise | [31;1mmeetup[m                   |
| You       | have                    | not       | unlocked | exercise | [31;1mnucleotide-count[m         |
| You       | have                    | not       | unlocked | exercise | [31;1mphone-number[m             |
| You       | have                    | not       | unlocked | exercise | [31;1mraindrops[m                |
| You       | have                    | not       | unlocked | exercise | [31;1mreverse-string[m           |
| You       | have                    | not       | unlocked | exercise | [31;1mrna-transcription[m        |
| You       | have                    | not       | unlocked | exercise | [31;1mroman-numerals[m           |
| You       | have                    | not       | unlocked | exercise | [31;1msay[m                      |
| You       | have                    | not       | unlocked | exercise | [31;1mtriangle[m                 |
| You       | have                    | not       | unlocked | exercise | [31;1mword-count[m               |
| You       | have                    | not       | unlocked | exercise | [31;1matbash-cipher[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mvariable-length-quantity[m |
| You       | have                    | not       | unlocked | exercise | [31;1mmatching-brackets[m        |
| You       | have                    | not       | unlocked | exercise | [31;1msublist[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mhouse[m                    |
| You       | have                    | not       | unlocked | exercise | [31;1mdarts[m                    |
|           |                         |           |          |          |                                      |
| ========= | [33;1mscheme[m      | ========= |          |          |                                      |
| You       | have                    | not       | unlocked | exercise | [31;1mhello-world[m              |
| You       | have                    | not       | unlocked | exercise | [31;1mleap[m                     |
| You       | have                    | not       | unlocked | exercise | [31;1mrna-transcription[m        |
| You       | have                    | not       | unlocked | exercise | [31;1mhamming[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mgrains[m                   |
| You       | have                    | not       | unlocked | exercise | [31;1managram[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mdifference-of-squares[m    |
| You       | have                    | not       | unlocked | exercise | [31;1mpascals-triangle[m         |
| You       | have                    | not       | unlocked | exercise | [31;1mknapsack[m                 |
| You       | have                    | not       | unlocked | exercise | [31;1mbinary-search[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mtwo-fer[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mtranspose[m                |
| You       | have                    | not       | unlocked | exercise | [31;1mforth[m                    |
| You       | have                    | not       | unlocked | exercise | [31;1mphone-number[m             |
| You       | have                    | not       | unlocked | exercise | [31;1mraindrops[m                |
| You       | have                    | not       | unlocked | exercise | [31;1mmatching-brackets[m        |
| You       | have                    | not       | unlocked | exercise | [31;1mperfect-numbers[m          |
| You       | have                    | not       | unlocked | exercise | [31;1mnucleotide-count[m         |
| You       | have                    | not       | unlocked | exercise | [31;1mscrabble-score[m           |
| You       | have                    | not       | unlocked | exercise | [31;1mword-count[m               |
| You       | have                    | not       | unlocked | exercise | [31;1mpangram[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1mqueen-attack[m             |
| You       | have                    | not       | unlocked | exercise | [31;1matbash-cipher[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mchange[m                   |
| You       | have                    | not       | unlocked | exercise | [31;1mcollatz-conjecture[m       |
| You       | have                    | not       | unlocked | exercise | [31;1mrotational-cipher[m        |
| You       | have                    | not       | unlocked | exercise | [31;1mprime-factors[m            |
| You       | have                    | not       | unlocked | exercise | [31;1mbob[m                      |
| You       | have                    | not       | unlocked | exercise | [31;1maffine-cipher[m            |
| You       | have                    | not       | unlocked | exercise | [31;1maccumulate[m               |
| You       | have                    | not       | unlocked | exercise | [31;1marmstrong-numbers[m        |
| You       | have                    | not       | unlocked | exercise | [31;1macronym[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1moctal[m                    |
| You       | have                    | not       | unlocked | exercise | [31;1mroman-numerals[m           |
| You       | have                    | not       | unlocked | exercise | [31;1mstrain[m                   |
| You       | have                    | not       | unlocked | exercise | [31;1msum-of-multiples[m         |
| You       | have                    | not       | unlocked | exercise | [31;1mtriangle[m                 |
| You       | have                    | not       | unlocked | exercise | [31;1mtrinary[m                  |
| You       | have                    | not       | unlocked | exercise | [31;1msieve[m                    |
|           |                         |           |          |          |                                      |
